Descriptive Statistics - Measures of Central Tendency and variability
Perform the following operations on any open source dataset (e.g., data.csv)
1. Provide summary statistics (mean, median, minimum, maximum, standard deviation) for a
Curriculum for Third Year of Artificial Intelligence and Data Science (2019 Course), Savitribai Phule Pune University
http://collegecirculars.unipune.ac.in/sites/documents/Syllabus2022/Forms/AllItems.aspx #84/105
dataset (age, income etc.) with numeric variables grouped by one of the qualitative
(categorical) variable. For example, if your categorical variable is age groups and quantitative
variable is income, then provide summary statistics of income grouped by the age groups.
Create a list that contains a numeric value for each response to the categorical variable.
2. Write a Python program to display some basic statistical details like percentile, mean,
standard deviation etc. of the species of ‘Iris-setosa’, ‘Iris-versicolor’ and ‘Iris-versicolor’ of
iris.csv dataset.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\Urvi\Downloads\archive (6)\Mall_Customers.csv")

In [3]:
df

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [4]:
df.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [5]:
df.shape

(200, 5)

In [6]:
df.index

RangeIndex(start=0, stop=200, step=1)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [8]:
df.columns

Index(['CustomerID', 'Genre', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [9]:
df.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [10]:
from sklearn import preprocessing
label_encoder = preprocessing.LabelEncoder()
df['Genre'] = label_encoder.fit_transform(df['Genre'])

In [11]:
df

     CustomerID  Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1      1   19                  15                      39
1             2      1   21                  15                      81
2             3      0   20                  16                       6
3             4      0   23                  16                      77
4             5      0   31                  17                      40
..          ...    ...  ...                 ...                     ...
195         196      0   35                 120                      79
196         197      0   45                 126                      28
197         198      1   32                 126                      74
198         199      1   32                 137                      18
199         200      1   30                 137                      83

[200 rows x 5 columns]

In [12]:
df.mean()

CustomerID                100.50
Genre                       0.44
Age                        38.85
Annual Income (k$)         60.56
Spending Score (1-100)     50.20
dtype: float64

In [13]:
df.median()

CustomerID                100.5
Genre                       0.0
Age                        36.0
Annual Income (k$)         61.5
Spending Score (1-100)     50.0
dtype: float64

In [14]:
df.max()

CustomerID                200
Genre                       1
Age                        70
Annual Income (k$)        137
Spending Score (1-100)     99
dtype: int64

In [15]:
df.min()

CustomerID                 1
Genre                      0
Age                       18
Annual Income (k$)        15
Spending Score (1-100)     1
dtype: int64

In [16]:
df.std()

CustomerID                57.879185
Genre                      0.497633
Age                       13.969007
Annual Income (k$)        26.264721
Spending Score (1-100)    25.823522
dtype: float64

In [17]:
df.groupby(["Genre"])["Age"].mean()

Genre
0    38.098214
1    39.806818
Name: Age, dtype: float64

In [18]:
df.groupby(["Genre"])["Annual Income (k$)"].mean()

Genre
0    59.250000
1    62.227273
Name: Annual Income (k$), dtype: float64

In [19]:
df.groupby(["Genre"])["Spending Score (1-100)"].mean()

Genre
0    51.526786
1    48.511364
Name: Spending Score (1-100), dtype: float64

In [20]:
df.groupby(["Genre"])["Age"].median()

Genre
0    35.0
1    37.0
Name: Age, dtype: float64

In [21]:
df.groupby(["Genre"])["Annual Income (k$)"].median()

Genre
0    60.0
1    62.5
Name: Annual Income (k$), dtype: float64

In [22]:
df.groupby(["Genre"])["Spending Score (1-100)"].median()

Genre
0    50.0
1    50.0
Name: Spending Score (1-100), dtype: float64

In [23]:
df_1 = pd.read_csv(r"C:\Users\Urvi\Downloads\archive (2)\iris.csv")

In [24]:
df_1

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [25]:
from sklearn import preprocessing

In [37]:

label_encode = preprocessing.LabelEncoder()
df_1['species'] = label_encode.fit_transform(df_1['species'])

In [38]:
df_1

     sepal_length  sepal_width  petal_length  petal_width  species
0             5.1          3.5           1.4          0.2        0
1             4.9          3.0           1.4          0.2        0
2             4.7          3.2           1.3          0.2        0
3             4.6          3.1           1.5          0.2        0
4             5.0          3.6           1.4          0.2        0
..            ...          ...           ...          ...      ...
145           6.7          3.0           5.2          2.3        2
146           6.3          2.5           5.0          1.9        2
147           6.5          3.0           5.2          2.0        2
148           6.2          3.4           5.4          2.3        2
149           5.9          3.0           5.1          1.8        2

[150 rows x 5 columns]

In [39]:
df_1.mean()

sepal_length    5.843333
sepal_width     3.054000
petal_length    3.758667
petal_width     1.198667
species         1.000000
dtype: float64

In [40]:
df_1.median()

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
species         1.00
dtype: float64

In [41]:
df_1.max()

sepal_length    7.9
sepal_width     4.4
petal_length    6.9
petal_width     2.5
species         2.0
dtype: float64

In [42]:
df_1.min()

sepal_length    4.3
sepal_width     2.0
petal_length    1.0
petal_width     0.1
species         0.0
dtype: float64

In [43]:
df_1.var()

sepal_length    0.685694
sepal_width     0.188004
petal_length    3.113179
petal_width     0.582414
species         0.671141
dtype: float64

In [44]:
df_1.std()

sepal_length    0.828066
sepal_width     0.433594
petal_length    1.764420
petal_width     0.763161
species         0.819232
dtype: float64

In [45]:
col_names = ['sepal_length', 'sepal_width', 'petal_length',	'petal_width',	'species']

In [48]:
iris_set = (df_1['species'] == 0)
print("Setosa")
print(df_1[iris_set].describe())

Setosa
       sepal_length  sepal_width  petal_length  petal_width  species
count      50.00000    50.000000     50.000000     50.00000     50.0
mean        5.00600     3.418000      1.464000      0.24400      0.0
std         0.35249     0.381024      0.173511      0.10721      0.0
min         4.30000     2.300000      1.000000      0.10000      0.0
25%         4.80000     3.125000      1.400000      0.20000      0.0
50%         5.00000     3.400000      1.500000      0.20000      0.0
75%         5.20000     3.675000      1.575000      0.30000      0.0
max         5.80000     4.400000      1.900000      0.60000      0.0

In [49]:
iris_set = (df_1['species'] == 1)
print("versicolor")
print(df_1[iris_set].describe())

versicolor
       sepal_length  sepal_width  petal_length  petal_width  species
count     50.000000    50.000000     50.000000    50.000000     50.0
mean       5.936000     2.770000      4.260000     1.326000      1.0
std        0.516171     0.313798      0.469911     0.197753      0.0
min        4.900000     2.000000      3.000000     1.000000      1.0
25%        5.600000     2.525000      4.000000     1.200000      1.0
50%        5.900000     2.800000      4.350000     1.300000      1.0
75%        6.300000     3.000000      4.600000     1.500000      1.0
max        7.000000     3.400000      5.100000     1.800000      1.0

In [50]:
iris_set = (df_1['species'] == 2)
print("verginica")
print(df_1[iris_set].describe())

verginica
       sepal_length  sepal_width  petal_length  petal_width  species
count      50.00000    50.000000     50.000000     50.00000     50.0
mean        6.58800     2.974000      5.552000      2.02600      2.0
std         0.63588     0.322497      0.551895      0.27465      0.0
min         4.90000     2.200000      4.500000      1.40000      2.0
25%         6.22500     2.800000      5.100000      1.80000      2.0
50%         6.50000     3.000000      5.550000      2.00000      2.0
75%         6.90000     3.175000      5.875000      2.30000      2.0
max         7.90000     3.800000      6.900000      2.50000      2.0